Rokasbarasa1/STM32-Quadcopter/src/main.c
float accelerometer_scale_factor_correction[3][3] = {
    {1.003744,0.048610,-0.014200},
    {0.048610,0.998828,-0.014525},
    {-0.014200,-0.014525,1.004423}
};


// Gyro
float gyro_correction[3] = {
    -2.532809, 2.282250, 0.640916
};

// handling loop timing ###################################################################################
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t delta_loop_time = 0;

// Accelerometer values to degrees conversion #############################################################
float accelerometer_roll = 0;
float accelerometer_pitch = 0;
float magnetometer_yaw = 0;

// Radio config ########################################################################################### 
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// PID errors ##############################################################################################
struct pid pitch_pid;
struct pid roll_pid;
struct pid yaw_pid;
struct pid vertical_velocity_pid;
struct pid gps_longitude_pid;
struct pid gps_latitude_pid;

float error_pitch = 0;
float error_roll = 0;
float error_yaw = 0;
float error_throttle = 0;
float error_vertical_velocity = 0;

float error_latitude = 0;
float error_longitude = 0;
float last_error_roll = 0;
float last_error_pitch = 0;


// Actual PID adjustment for pitch
#define BASE_PITCH_ROLL_MASTER_GAIN 0.4
#define BASE_PITCH_ROLL_GAIN_P 0.0 // 0.35
#define BASE_PITCH_ROLL_GAIN_I 0.0 // 0.0
#define BASE_PITCH_ROLL_GAIN_D 0.0 // 130.0


// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.

// PID for yaw
// const float yaw_gain_p = 0.45; 
// const float yaw_gain_i = 0.3;

const float yaw_gain_p = 0.0; 
const float yaw_gain_i = 0.0;

// PID for altitude control
const float vertical_velocity_gain_p = 0.6; 
const float vertical_velocity_gain_i = 0.25;
const float vertical_velocity_gain_d = 0.00;

// PID for gps hold
// const float gps_hold_gain_p = 700000.0; 
// const float gps_hold_gain_p = 700000.0; 
const float gps_hold_gain_p = 700000.0; 
const float gps_hold_gain_i = 0.0;
// const float gps_hold_gain_d = 8500.0;
// const float gps_hold_gain_d = 350000.0;
// const float gps_hold_gain_d = 35000.0;
const float gps_hold_gain_d = 7000.0;


const float gps_pid_angle_of_attack_max = 5.0;

// Used for smooth changes to PID while using remote control. Do not touch this

float pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN; // Dont you just love the STM#2 compiler?
float pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P;
float pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I;
float pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D;

float added_pitch_roll_master_gain = 0;
float added_pitch_roll_gain_p = 0;
float added_pitch_roll_gain_i = 0;
float added_pitch_roll_gain_d = 0;

// Refresh rate ##############################################################################################

// remember that the stm32 is not as fast as the esp32 and it cannot print lines at the same speed
// const float refresh_rate_hz = 400;
#define REFRESH_RATE_HZ 200

// Sensor stuff ##############################################################################################
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
// float complementary_beta = 0.005;
float complementary_beta = 0.0;

// The lower the alpha the less filtering is happening
float filtering_alpha_magnetometer = 0.85; // 200Hz sample rate and 0.85 alpha gives 180Hz cutoff and around 1ms delay
float filtering_alpha_barometer = 0.01;

float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float imu_orientation[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
float gps_longitude = 0.0;
float old_gps_longitude = 0.0;
float gps_latitude = 0.0;
float old_gps_latitude = 0.0;
float delta_gps_latitude = 0.0;
float delta_gps_longitude = 0.0;
float in_between_gps_latitude = 0.0;
float in_between_gps_longitude = 0.0;
uint8_t in_between_gps_loop_divider = 50;
uint8_t in_between_gps_loop_divider_counter = 0;


uint8_t gps_fix_type = 0.0;

float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;
float vertical_velocity = 0.0;

float target_pitch = 0.0;
float target_roll = 0.0;
float target_yaw = 0.0;
float target_altitude = 0.0;
float target_vertical_velocity = 0.0;
float target_longitude = 0.0;
float target_latitude = 0.0;

float motor_power[] = {0.0, 0.0, 0.0, 0.0};


// Remote control settings ############################################################################################
float max_yaw_attack = 40.0;

float max_pitch_attack = 10;
float pitch_attack_step = 0.2;

float max_roll_attack = 10;
float roll_attack_step = 0.2;

float max_throttle_vertical_velocity = 30; // cm/second
float min_throttle_vertical_velocity = -30; // cm/second

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

uint8_t slowing_lock = 0;

float last_raw_yaw = 0;
float delta_yaw = 0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint32_t last_signal_timestamp = 0;


// For deciding which log file to log to
char log_file_base_name[] = "Quadcopter.txt";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;
const uint8_t use_simple_async = 0; // 0 is the complex async
const uint8_t use_blackbox_logging = 0; 


// Keep track of time in each loop. Since loop start
uint32_t startup_time = 0;
uint32_t delta_time = 0;
uint16_t time_since_startup_ms = 0;
uint8_t time_since_startup_minutes = 0;
uint8_t time_since_startup_seconds = 0;
uint8_t time_since_startup_hours = 0;


