Rokasbarasa1/STM32-Quadcopter/src/main.c
            // if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
            //     gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
            // }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
            //     gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
            // } 
        
            // if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
            //     gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
            // }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
            //     gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
            // }
            
            // gps_hold_roll_adjustment = gps_hold_roll_adjustment_integral + map_value(
            //     gps_hold_roll_adjustment_calculation, 
            //     -gps_pid_angle_of_attack_max, 
            //     gps_pid_angle_of_attack_max, 
            //     -pitch_attack_step, 
            //     pitch_attack_step
            // );

            // gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation + map_value(
            //     gps_hold_pitch_adjustment_calculation, 
            //     -gps_pid_angle_of_attack_max, 
            //     gps_pid_angle_of_attack_max, 
            //     -pitch_attack_step, 
            //     pitch_attack_step
            // );

            // if(gps_hold_roll_adjustment > gps_pid_angle_of_attack_max){
            //     gps_hold_roll_adjustment = gps_pid_angle_of_attack_max;
            // }else if(gps_hold_roll_adjustment < -gps_pid_angle_of_attack_max){
            //     gps_hold_roll_adjustment = -gps_pid_angle_of_attack_max;
            // }
            
            // if(gps_hold_pitch_adjustment > gps_pid_angle_of_attack_max){
            //     gps_hold_pitch_adjustment = gps_pid_angle_of_attack_max;
            // }else if(gps_hold_pitch_adjustment < -gps_pid_angle_of_attack_max){
            //     gps_hold_pitch_adjustment = -gps_pid_angle_of_attack_max;
            // }



            if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
            }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
            } 
        
            if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
            }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
            }

            gps_hold_roll_adjustment = gps_hold_roll_adjustment_calculation;
            gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation;
            
            // printf("%f;%f;%f;%f;%.2f;%.2f;%.2f;%.2f;%.2f;", target_latitude, target_longitude, gps_latitude, gps_longitude, gps_hold_roll_adjustment, gps_hold_pitch_adjustment, imu_orientation[0], imu_orientation[1], imu_orientation[2]);
            // printf("%.2f;%.2f;%.2f;%.2f;", roll_effect_on_lat, roll_effect_on_lon, pitch_effect_on_lat, pitch_effect_on_lon);
            // printf("\n");

            last_error_roll = gps_hold_roll_adjustment;
            last_error_pitch = gps_hold_pitch_adjustment;

            // printf("off: %3.1f %3.1f\n", gps_hold_roll_adjustment, gps_hold_pitch_adjustment);
        }else if(gps_position_hold_enabled && got_gps == 0){
            // Put in the same values'
            gps_hold_roll_adjustment = last_error_roll;
            gps_hold_pitch_adjustment = last_error_pitch;
        }

        // ----------------------------------------------------------------------------------------------INNER LOOP PID
        pid_set_desired_value(&roll_pid, target_roll + gps_hold_roll_adjustment);
        pid_set_desired_value(&pitch_pid, target_pitch + gps_hold_pitch_adjustment);
        pid_set_desired_value(&yaw_pid, target_yaw);
        pid_set_desired_value(&vertical_velocity_pid, target_vertical_velocity);

        PID_set_points[0] = target_pitch; // Logging
        PID_set_points[1] = target_roll; // Logging
        PID_set_points[2] = target_yaw; // Logging

        // pitch is facing to the sides
        // roll is facing forwards and backwards

        error_roll = pid_get_error(&roll_pid, imu_orientation[0], HAL_GetTick());
        PID_proportional[1] = pid_get_last_proportional_error(&roll_pid); // Logging
        PID_integral[1] = pid_get_last_integral_error(&roll_pid); // Logging
        PID_derivative[1] = pid_get_last_derivative_error(&roll_pid); // Logging
        
        error_pitch = pid_get_error(&pitch_pid, imu_orientation[1], HAL_GetTick());
        PID_proportional[0] = pid_get_last_proportional_error(&pitch_pid); // Logging
        PID_integral[0] = pid_get_last_integral_error(&pitch_pid); // Logging
        PID_derivative[0] = pid_get_last_derivative_error(&pitch_pid); // Logging


        error_yaw = pid_get_error(&yaw_pid, gyro_angular[2], HAL_GetTick()); // Logging
        PID_proportional[2] = pid_get_last_proportional_error(&yaw_pid); // Logging
        PID_integral[2] = pid_get_last_integral_error(&yaw_pid); // Logging

        error_vertical_velocity = pid_get_error(&vertical_velocity_pid, vertical_velocity, HAL_GetTick());

        error_throttle = throttle*0.9;

        motor_power[0] = ( error_pitch) +  ( error_roll) + ( error_yaw);
        motor_power[1] = ( error_pitch) +  (-error_roll) + (-error_yaw);
        motor_power[2] = (-error_pitch) +  (-error_roll) + ( error_yaw);
        motor_power[3] = (-error_pitch) +  ( error_roll) + (-error_yaw);

        // For throttle control logic
        motor_power[0] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[1] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[2] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[3] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;

        // Motor B (0) 14460 rpm
        // Motor C (1) 14160 rpm
        // Motor D (2) 14460 rpm
        // Motor A (3) 13740 rpm

        // GPS side BACK
        TIM2->CCR1 = setServoActivationPercent(motor_power[2], esc_lowest_motor_spin, actual_max_esc_pwm_value);
        TIM2->CCR2 = setServoActivationPercent(motor_power[3], esc_lowest_motor_spin, actual_max_esc_pwm_value);

