Rokasbarasa1/STM32-Quadcopter/src/main.c
            // Reset the yaw to the current degrees
            // if(last_yaw != 50 && yaw == 50){
            //     target_yaw = imu_orientation[2];
            // }

            // last_yaw = yaw;

            // Throttle ##################################################################################################################
            // This is only used for flight mode 1
            target_vertical_velocity = map_value(throttle, 0, 100, min_throttle_vertical_velocity, max_throttle_vertical_velocity);

        }else if(strcmp(rx_type, "pid") == 0){
            printf("\nGot pid");
            
            float added_proportional = 0;
            float added_integral = 0;
            float added_derivative = 0;
            float added_master_gain = 0;

            extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

            pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P + added_proportional;
            pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I + added_integral;
            pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D + added_derivative;
            pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN + added_master_gain;

            added_pitch_roll_gain_p = added_proportional;
            added_pitch_roll_gain_i = added_integral;
            added_pitch_roll_gain_d = added_derivative;
            added_pitch_roll_master_gain = added_master_gain;

            // Configure the pitch pid 
            pid_set_proportional_gain(&pitch_pid, pitch_roll_gain_p * pitch_roll_master_gain);
            pid_set_integral_gain(&pitch_pid, pitch_roll_gain_i * pitch_roll_master_gain);
            pid_set_derivative_gain(&pitch_pid, pitch_roll_gain_d * pitch_roll_master_gain);
            pid_reset_integral_sum(&pitch_pid);

            // Configure the roll pid 
            pid_set_proportional_gain(&roll_pid, pitch_roll_gain_p * pitch_roll_master_gain);
            pid_set_integral_gain(&roll_pid, pitch_roll_gain_i * pitch_roll_master_gain);
            pid_set_derivative_gain(&roll_pid, pitch_roll_gain_d * pitch_roll_master_gain);
            pid_reset_integral_sum(&roll_pid);

        }else if(strcmp(rx_type, "remoteSyncBase") == 0){
            printf("\nGot remoteSyncBase");
            send_pid_base_info_to_remote();
        }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
            printf("\nGot remoteSyncAdded");
            send_pid_added_info_to_remote();
        }else if(strcmp(rx_type, "accel") == 0){

            float added_x_axis_offset;
            float added_y_axis_offset;

            extract_accelerometer_offsets(rx_data, strlen(rx_data), &added_x_axis_offset, &added_y_axis_offset);
            printf("\nGot offsets %f %f ", -added_x_axis_offset, -added_y_axis_offset);

            accelerometer_roll_offset = base_accelerometer_roll_offset - added_x_axis_offset;
            accelerometer_pitch_offset = base_accelerometer_pitch_offset -  added_y_axis_offset;

            pid_reset_integral_sum(&roll_pid);
            pid_reset_integral_sum(&pitch_pid);

            calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration

            // Get the initial position again
            get_initial_position();

            // Capture any radio messages that were sent durring the calibration proccess and discard them
            for (uint8_t i = 0; i < 50; i++){
                if(nrf24_data_available(1)){
                    nrf24_receive(rx_data);
                }
            }

            // Reset the sesor fusion and the pid accumulation
        }else if(strcmp(rx_type, "fm") == 0){
            printf("\nGot flight mode");

            uint8_t new_flight_mode;

            extract_flight_mode(rx_data, strlen(rx_data), &new_flight_mode);

            printf("\nGot new flight mode %d\n", new_flight_mode);
            flight_mode = new_flight_mode;

            if(flight_mode == 1){
                use_vertical_velocity_control = 1;
                use_gps_hold = 0;
            }else if(flight_mode == 0){
                use_vertical_velocity_control = 0;
                use_gps_hold = 0;
            }else if(flight_mode == 2){
                use_vertical_velocity_control = 1;
                use_gps_hold = 1;
            }else if (flight_mode == 3){
                use_gps_hold = 1;
            }

            find_accelerometer_error(10);

        }

        rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
    }
}


void initialize_control_abstractions(){
    pitch_pid = pid_init(pitch_roll_master_gain * pitch_roll_gain_p, pitch_roll_master_gain * pitch_roll_gain_i, pitch_roll_master_gain * pitch_roll_gain_d, 0.0, HAL_GetTick(), 10.0, -10.0, 1);
    roll_pid = pid_init(pitch_roll_master_gain * pitch_roll_gain_p, pitch_roll_master_gain * pitch_roll_gain_i, pitch_roll_master_gain * pitch_roll_gain_d, 0.0, HAL_GetTick(), 10.0, -10.0, 1);
    yaw_pid = pid_init(yaw_gain_p, yaw_gain_i, 0, 0.0, HAL_GetTick(), 10.0, -10.0, 1);
    vertical_velocity_pid = pid_init(vertical_velocity_gain_p, vertical_velocity_gain_i, vertical_velocity_gain_d, 0.0, HAL_GetTick(), 90.0, 0.0, 1); // Min value is 0 because motors dont go lower that that
    gps_longitude_pid = pid_init(gps_hold_gain_p, gps_hold_gain_i, gps_hold_gain_d, 0.0, HAL_GetTick(), gps_pid_angle_of_attack_max, -gps_pid_angle_of_attack_max, 1);
    gps_latitude_pid = pid_init(gps_hold_gain_p, gps_hold_gain_i, gps_hold_gain_d, 0.0, HAL_GetTick(), gps_pid_angle_of_attack_max, -gps_pid_angle_of_attack_max, 1);

    filter_magnetometer_x = filtering_init_low_pass_filter(filtering_alpha_magnetometer);
    filter_magnetometer_y = filtering_init_low_pass_filter(filtering_alpha_magnetometer);
    filter_magnetometer_z = filtering_init_low_pass_filter(filtering_alpha_magnetometer);

    float S_state[2][1] = {
        {0},
        {0}
    };

    float F_state_transition[2][2] = {
        {1, 0.005},
        {0, 1}
    };

    float P_covariance[2][2] = {
        {0, 0},
        {0, 0}
    }; 

